import re,mysql.connector,json,jft

#----json 文件
#file1 = 'D:\\张玉龙\\源文件\\trip_cityId\\POIs_US_tripadvisor_20140428.txt'
#f1    = open(file1,'r',encoding='utf-8')

##########################
#----tag
##########################
dic = {'喜剧俱乐部':62,'街坊':162,'图书馆':146,'「课程/工作坊」':235,'市政中心':78,'越野/沙滩车步道':255,'观光巴士':255,'葡萄酒庄':59,'自然历史博物馆':113,
'喷泉':162,'自然保育区':162,'其他':162,'政府机关':78,'步道':162,'Attraction':162,'商店':35,'交响乐':62,'歌剧':62,'动物园':165,'海滩':168,'科学博物馆':113,
'墓园':162,'名产店':35,'公园':162,'山谷':162,'渡轮/船':255,'农场':162,'教堂/大教堂':162,'观景台/天文台':162,'大峡谷':162,'芭蕾舞':62,'保龄球馆':207,
'教育施设':252,'Spa':234,'观景台/塔':162,'演唱会':62,'水上乐园':167,'同性恋酒吧':59,'竞技场/体育场':161,'牧场':162,'运动营/健诊营':152,'大众交通':255,
'瀑布':162,'画廊':139,'军事基地/设施':162,'爵士酒吧':59,'儿童博物馆':113,'宗教地点':162,'舞厅/迪斯可':238,'剧场':62,'游戏/娱乐中心':238,'渡假中心':162,
'艺术建筑':162,'船舶':255,'单车步道':255,'健行步道':255,'铁路旅游':162,'纪念碑/雕像':162,'马术步道':162,'岛屿':162,'瞭望台':162,'健身中心':152,'步行游览':162,
'大洞穴/洞窟':162,'迪士尼':167,'城堡':162,'钢琴酒吧':59,'赌场':238,'军事博物馆':113,'森林':162,'天然涌泉/温泉':162,'海湾':162,'电影院':61,'历史博物馆':113,
'沙漠':162,'旅客服务中心':162,'畅货中心':242,'乡村酒吧':59,'空城':162,'会议中心':271,'酒吧/俱乐部':59,'马廄':162,'百货公司':35,'自驾旅游':162,'慢跑步道':255,
'水上运动':262,'餐馆剧院':62,'山脉':162,'历史古蹟':162,'国家公园':162,'冲浪营地':162,'花园':162,'购物中心':35,'游艇':162,'啤酒厂':229,'预约式':162,'博物馆':113,
'综合体育馆':161,'滑雪区':160,'桥樑':162,'水坝':162,'地标/景点':162,'交通工具':255,'Segway旅游':162,'跳蚤市场/露天市集':242,'酿酒厂':229,'古代遗址':162,
'灵异景点':162,'赛车场':162,'越野滑雪区':160,'战地史迹':162,'高尔夫球场':154,'灯塔':162,'徒步观景区':162,'古董店':216,'珊瑚礁':162,'表演':62,'旅游':162,
'岩矿观光':162,'码头/堤防/人行道':162,'咖啡馆':22,'美术馆':139,'州立公园':162,'矿山':162,'赛狗场':162,'主题乐园':167,'码头':98,'工厂参访':229,'雪茄吧':238,
'特色博物馆':113,'史迹徒步区':162,'美式料理':13007,'四川菜':1510,'汤品':26,'瑞士料理':13006,'挪威料理':13006,'斯里兰卡料理':2999,'义式料理':13002,
'地中海料理':13006,'全素食':32,'酒吧':59,'家庭套餐':13099,'摩洛哥料理':13099,'马来西亚料理':2907,
'印度料理':2901,'麵食':26,'咖啡/轻食':22,'汉堡':16,'纽西兰料理':13099,'牛排':13099,'墨西哥料理':13011,'cuisine.name.191':13099,'乌克兰料理':13006,
'中华料理':15,'法式料理':13001,'Anhui':1517,'酒吧/夜店':59,'开胃小馆':26,'培果':26,'中东料理':13005,'游乐场':167,'波利尼亚料理':13099,'犹太料理':13099,
'巴基斯坦料理':13005,'爱尔兰料理':13006,'印第安&克里奥耳':13099,'拉丁料理':13004,'波斯料理':13006,'孟加拉料理':13006,'美国西南料理':13007,
'西藏料理':1518,'非洲料理':13099,'匈牙利料理':13006,'甜点':132,'埃塞俄比亚料理':13099,'秘鲁料理':13099,'埃及料理':13099,'高棉料理':2999,
'ImperialChinese':15,'阿根廷料理':13099,'阿富汗料理':13005,'多国料理':13099,'鸡翅':26,'巴哈马料理':13099,'NorthEasternChinese':1504,
'萨尔瓦多菜':13099,'瑞典料理':13006,'太平洋料理':13099,'快餐':16,'西班牙料理':13008,'冰淇淋':132,'加勒比料理':13099,'甜甜圈':26,'热狗':16,
'丹麦料理':13006,'烤肉':30,'啤酒餐厅':59,'罗马尼亚料理':13099,'湖南菜':1502,'NorthWesternChinese':1506,'德式料理':13009,'欧陆料理':13006,
'烧烤/BBQ':30,'中美料理':13007,'南斯拉夫料理':13006,'熟食店':26,'现代创意料理':13099,'蒙古料理':1516,'马场':262,'土耳其料理':13006,'现酿啤酒吧':59,
'ChineseHotpot':133,'尼泊尔料理':2999,'亚洲料理':2999,'澳洲料理':13099,'斯堪的纳维亚菜':13099,'Cantonese':1519,'起士火锅':1339,'波兰料理':13006,
'波多黎各料理':13099,'亚洲创作料理':2999,'希腊料理':13006,'Hangzhou':1512,'披萨&意大利麵':13002,'韩式料理':217,'生蚝吧':134,'教堂':162,
'HongKong':1519,'前卫料理':13099,'披萨':13099,'亚美尼亚料理':13099,'荷兰料理':13006,'素食':32,'炸鱼&薯条':26,'比利时料理':13006,'蓝调酒吧':59,
'克罗地亚菜':13099,'酒庄':59,'泰式料理':219,'委内瑞拉料理':13099,'东欧料理':13006,'Hotel':148,'台湾小吃/台菜':31,'清真菜':28,'加州料理':13007,
'巴西料理':13099,'哥伦比亚料理':13099,'菲律宾料理':2999,'义大利麵':13002,'越南料理':2902,'日本料理':218,'葡萄牙料理':13006,'点心/饮茶':63,
'三明治':16,'红酒吧':59,'麵馆':26,'阿尔巴尼亚菜':13099,'上海菜':1513,'俄罗斯料理':13003,'缅甸料理':2904,'巴斯克料理':13099,'Restaurant':130,
'西班牙小吃':13008,'欧式料理':13006,'有机料理':13099,'中欧料理':13006,'Zhejiang':1512,'智利料理':13099,'亚洲风味菜':2999,'海鲜餐厅':134,
'黎巴嫩料理':13006,'小酒馆':59,'英式料理':13010,'茶馆':63,'加拿大料理':13099,'路面电车':255,'寿司':2182,'捷克料理':13006,'苏格兰料理':13006,
'南美风味':13099,'古巴料理':13099,'烘培坊':131,'咖啡店':22,'巧达汤':26,'健康料理':13099,'异国风味':13099,'以色列料理':13099,'印尼料理':2906,
'MinorityChinese':1599,'可丽饼':26,'印第安料理':13099,'奥地利料理':13006,'牙买加料理':13099,'晚餐':13099,'夏威夷料理':13099,'BeijingSpecialties':1509}
#--繁简体转换
##file1 = 'D:\\张玉龙\\Python\\20140429_tag.txt'
##file2 = 'D:\\张玉龙\\Python\\20140429_tag_j.txt'
##f1    = open(file1,'r',encoding='utf-8')
##f2    = open(file2,'w',encoding='utf-8')
##for s in f1:
##    if re.findall('[\u4e00-\u9fa5]',s):
##        f2.write(jft.f2j('utf8','utf8',s))
##    else:
##        f2.write(s)
##f2.close()
###--找出所有的tag
##f3 = open(file2,'r',encoding='utf-8')
##a = []
##for s in f3:
##    for i in s.split('"')[-2].split(','):
##        if i not in dic.keys():
##            a.append(i)
##a = set(a)
##print(len(a))
##f1.close()
##f3.close()

#----生成sql
file1 = 'D:\\张玉龙\\Python\\20140429_tag_j.txt'
file2 = 'D:\\张玉龙\\Python\\提交\\20140429_UPDATE_catId.sql'
f1    = open(file1,'r',encoding='utf-8')
f2    = open(file2,'w',encoding='utf-8')
catIddic   = {11:11,15:11,16:11,22:11,26:11,27:11,30:11,34:34,35:34,37:34,38:34,40:40,41:41,43:43,44:44,47:40,50:34,51:34,52:34,54:34,55:34,59:18,
              61:18,62:18,63:11,66:18,72:18,75:18,76:76,77:76,78:76,79:76,81:183,83:183,84:208,85:183,89:43,90:43,92:43,93:43,97:44,98:44,99:44,
              100:44,101:44,113:41,115:34,130:11,131:11,132:11,133:11,134:11,135:34,138:18,139:41,142:183,144:43,145:43,146:43,148:148,149:40,
              150:44,151:151,152:151,153:151,154:151,155:151,156:151,157:151,158:151,159:151,160:151,161:151,162:41,165:41,166:41,167:41,168:41,
              170:138,175:11,177:34,178:183,179:11,180:208,181:40,183:183,185:83,187:83,188:83,189:83,190:83,191:83,192:83,193:83,194:83,195:83,
              196:83,197:83,198:83,199:83,200:83,201:83,203:183,204:183,205:34,206:34,207:151,208:208,209:208,210:208,212:40,213:40,214:40,216:34,
              217:11,218:11,219:11,221:18,222:41,223:34,224:34,225:34,226:183,227:34,229:76,230:41, 232:18,233:41,234:18,235:41,236:41,237:41,
              238:41,239:34,240:34,241:34,242:34,243:183,244:183,245:183, 246:183,247:183,248:183,249:183,250:183,252:43,253:44,254:44,255:44,
              256:40,257:40,258:40,259:151,260:151,261:151,262:151,263:208,264:208,265:208,266:208,267:208,268:208,269:76,270:76,271:76,272:40,
              1331:11,1332:11,1333:11,1334:11,1339:11,1501:11,1502:11,1503:11,1504:11,1505:11,1506:11,1507:11,1508:11,1509:11,1510:11,1511:11,
              1512:11,1513:11,1514:11,1515:11,1516:11,1517:11,1518:11,1519:11,1520:11,1521:11,1522:11,1523:11,1524:11,1599:11,2181:11,2182:11,
              2189:11,2901:11,2902:11,2903:11,2904:11,2905:11,2906:11,2907:11,2999:11,13001:11,13002:11,13003:11,13004:11,13005:11,13006:11,
              13007:11,13008:11,13009:11,13010:11,13011:11,13099:11,32:11,31:11,28:11}
##            {11:11,15:11,16:11,22:11,26:11,27:11,30:11,34:0,35:34,37:34,38:34,40:40,41:41,43:43,44:44,47:40,50:34,51:34,52:34,54:34,
##            55:34,59:18,61:18,62:18,63:11,66:18,72:18,75:18,76:76,77:76,78:76,79:76,81:183,83:183,84:208,85:183,89:43,90:43,
##            92:43,93:43,97:44,98:44,99:44,100:44,101:44,113:41,115:34,130:11,131:11,132:11,133:11,134:11,135:34,138:18,
##            139:41,142:183,144:43,145:43,146:43,148:148,149:40,150:44,151:151,152:151,153:151,154:151,155:151,156:151,
##            157:151,158:151,159:151,160:151,161:151,162:41,165:41,166:41,167:41,168:41,170:138,175:11,177:34,178:183,
##            179:11,180:208,181:40,183:183,185:83,187:83,188:83,189:83,190:83,191:83,192:83,193:83,194:83,195:83,196:83,
##            197:83,198:83,199:83,200:83,201:83,203:183,204:183,205:34,206:34,207:151,208:208,209:208,210:208,212:40,
##            213:40,214:40,216:34,217:11,218:11,219:11,221:18,222:41,223:34,224:34,225:34,226:183,227:34,229:76,230:41,
##            232:18,233:41,234:18,235:41,236:41,237:41,238:41,239:34,240:34,241:34,242:34,243:183,244:183,245:183,
##            246:183,247:183,248:183,249:183,250:183,252:43,253:44,254:44,255:44,256:40,257:40,258:40,259:151,260:151,
##            261:151,262:151,263:208,264:208,265:208,266:208,267:208,268:208,269:76,270:76,271:76,272:40}
#b = []
for s in f1:
##    if re.findall('2014-04-21 12:00:00',s):
    a = []
    for i in s.split('"')[-2].split(','):
        a.append(dic[i])
    sql = 'UPDATE townfile_local SET catId = %s, parentId = %s,updateTime = "2014-04-29 16:00:00" WHERE localId = %s;\n'% (a[0],catIddic[a[0]],s.split(',')[0])
    #b.append(catIddic[a[0]])
    f2.write(sql)
#print(set(b))
f1.close()
f2.close()

################################
#----cityId，countryId
################################

##dic = {}
##f2 = open('d:/张玉龙/Python/20140421_cityId_countryId.txt','w',encoding='utf-8')
##f3 = open('D:\\张玉龙\\源文件\\20140421_tripsource.csv','r',encoding='utf-8')
##dic3 = {}
##for s in f3:
##    sourceId = re.findall('(tripadvisor_g[^,\"]+)',s)
##    if sourceId:
##        sourceId = sourceId[0]
##        b = re.split('"|,|\n',s)
##        if sourceId not in dic3.keys():
##            dic3[sourceId] = [b[0],b[-7]]
##for s in f1:
##    j = json.loads(s)
##    sourceId = re.findall('(tripadvisor_g[^\"]+)',s)
##    try:
##        if sourceId:
##            sourceId = sourceId[0]
##            if j['country'] and j['provice'] and j['city']:
##                string = '%s~%s~%s'% (j['country'],j['provice'],j['city'])
##                if string in dic.keys():
##                    line = '%s,"%s",%s,"%s","%s"\n'% (dic3[sourceId][0],dic[string][1],dic[string][0],dic3[sourceId][1],sourceId)#localId,"countryId",cityId,"updateTime","sourceId"
##                else:
##                    line = '%s,"",,"%s","%s"\n'% (dic3[sourceId][0],dic3[sourceId][1],sourceId)
##            else:
##                line = '%s,"",,"%s","%s"\n'% (dic3[sourceId][0],dic3[sourceId][1],sourceId)
##            f2.write(line)
##    except:
##        print(s)
##f2.close()
##f3.close()

#（1）整理全部的sourceId与原始的country、provice、city的映射

##f2 = open('D:\\张玉龙\\源文件\\trip_cityId\\POIs_tripadvisor_20131210.txt','r',encoding='utf-8')
##f3 = open('D:\\张玉龙\\源文件\\trip_cityId\\POIs_Attraction_US_tripadvisor_20140418.txt','r',encoding='utf-8')
##dic1 = {}
##for s in f2:
##    j = json.loads(s)
##    if j['sourceId'] not in dic1.keys():
##        if j['country'] and j['provice'] and j['city']:
##            string = '%s~%s~%s'% (j['country'],j['provice'],j['city'])
##            dic1[j['sourceId']]=string #country~provice~city
##for s in f3:
##    j = json.loads(s)
##    if j['sourceId'] not in dic1.keys():
##        if j['country'] and j['provice'] and j['city']:
##            string = '%s~%s~%s'% (j['country'],j['provice'],j['city'])
##            dic1[j['sourceId']]=string
##            
###（2）整理出sourceId与localId、countryId、cityId的映射
##            
##f4 = open('D:\\张玉龙\\源文件\\20140429_sourceId_cityId_localId.csv','r',encoding='utf-8')
##dic2 = {}
##for s in f4:
##    b = re.split(',|\n',s)
##    if re.findall('(tripadvisor_g[^,\"]+)',s):
##        for t in re.findall('(tripadvisor_g[^,\"]+)',s):
##            if t not in dic2.keys():
##                dic2[t] = [b[-2],b[-3]]#[localId,cityId]
##                
###（3）通过（1）和（2）建立原始的country、provice、city与countryId，cityId的映射
##                
##dic3 = {}
##for k in dic1:
##    if k in dic2.keys():
##        if dic1[k] not in dic3.keys():
##            dic3[dic1[k]] = dic2[k][1]
##            
###（4）根据新进数据的country、provice、city映射到countryId，cityId，并根据sourceId映射到localId
##            
##f5 = open('D:\\张玉龙\\源文件\\20140429_tripsource_insert.csv','r',encoding='utf-8')
##f6 = open('d:/张玉龙/Python/20140429_cityId.txt','w',encoding='utf-8')
##f7 = open('d:/张玉龙/Python/20140429_nocityId.txt','w',encoding='utf-8')
##dic4 = {}
####i=0
##for s in f5:
##    b = re.split(',"|"',s)
##    dic4[b[1]]=b[0]
##for s in f1:
##    j = json.loads(s)
##    #print(j['sourceId'])
##    if j['sourceId'] not in dic4.keys():
##        pass
##    else:
##        if j['country'] and j['provice'] and j['city']:
##            string = '%s~%s~%s'% (j['country'],j['provice'],j['city'])
##            if string in dic3.keys():
##                line = '%s,"%s",%s,"%s"\n'% (dic4[j['sourceId']],'US',dic3[string],j['sourceId'])#localId,"countryId",cityId,"sourceId"
##                f6.write(line)
##            else:
##                line = '%s,"%s",%s~%s,"%s"\n'% (dic4[j['sourceId']],'US',j['provice'],j['city'],j['sourceId'])
##                f7.write(line)
##        else:
##            line = '%s,"%s",0,"%s"\n'% (dic4[j['sourceId']],'US',j['sourceId'])
##            f6.write(line)
##        
####        print(line)
####        i+=1
####    if i>10:
####        break
##f2.close()
##f3.close()
##f4.close()
##f5.close()
##f6.close()

#--整理city表
##f7 = open('d:/张玉龙/Python/20140429_nocityId.txt','r',encoding='utf-8')
##f8 = open('d:/张玉龙/Python/提交/20140429_INSERT_city.sql','w',encoding='utf-8')
##f9 = open('d:/张玉龙/Python/20140429_nocityId_w.txt','w',encoding='utf-8')
##city = []
##dic5 = {}
##cityId = 63013
##for s in f7:
##    b = re.findall('",([^~]+~[\S ]+),"trip',s)[0]
##    #city = set(city)
##    if b not in city:
##        dic5[b] = cityId
##        #city = list(city)
##        city.append(b)
##        c = b.replace('_',' ').split('~')
##        sql = 'INSERT INTO city (cityId,countryId,cityName,province) VALUES (%s,"US","%s","%s");\n'% (cityId,c[1],c[0])
##        f8.write(sql)
##        cityId+=1
##
##    string = s.replace(b,str(dic5[b]))
##    f9.write(string)
##f7.close()
##f8.close()
##f9.close()

#-生成sql
##f6 = open('d:/张玉龙/Python/20140429_cityId.txt','r',encoding='utf-8')
##f10= open('d:/张玉龙/Python/提交/20140429_UPDATE_cityId.sql','w',encoding='utf-8')
##for s in f6:
##    b = re.split(',',s)
##    sql = 'UPDATE townfile_local SET countryId = %s, cityId = %s, updateTime = "2014-04-29 12:00:00" WHERE localId = %s ;\n'% (b[1],b[2],b[0])
##    f10.write(sql)
##
##f6.close()
##f10.close()

##f2 = open('d:/张玉龙/Python/20140421_cityId_countryId.txt','r',encoding='utf-8')
##f3 = open('d:/张玉龙/Python/提交/20140421_UPDATE_cityId_countryId.sql','w',encoding='utf-8')
##f4 = open('D:\\张玉龙\\源文件\\20140421_tripsource.csv','r',encoding='utf-8')
##dic3 = {}
##for s in f4:
##    sourceId = re.findall('tripadvisor_(g[\d]+)-',s)
##    if sourceId:
##        for t in sourceId:
##            b = re.split('"|,|\n',s)
##            if t not in dic3.keys():
##                dic3[t] = [b[-4],b[-2]]#[countryId,cityId]
##for s in f2:
##    if re.findall('2014-04-21 12:00:00',s):
##        b = re.split(',',s)
##        if re.findall('""',s):
####            print(s.split('"')[-2].split('-')[0])
####            a.append(s.split('"')[-2].split('-')[0])
##            sourceId = re.findall('tripadvisor_(g[\d]+)-',s)[0]
##            sql = 'UPDATE townfile_local SET countryId = "%s", cityId = %s, updateTime = "2014-04-21 18:00:00" WHERE localId = %s;\n'% (dic3[sourceId][0],dic3[sourceId][1],b[0])
##        else:            
##            sql = 'UPDATE townfile_local SET countryId = %s, cityId = %s, updateTime = "2014-04-21 18:00:00" WHERE localId = %s;\n'% (b[1],b[2],b[0])
##        f3.write(sql)
###print(set(a))
##f2.close()
##f3.close()
##f4.close()
f1.close()

